name: "CaffeModel"

input: "data"
input_dim: 1
input_dim: 6
input_dim: 70
input_dim: 70

layer {
  name: "layer1"
  type: "Convolution"
  bottom: "data"
  top: "layer1"
  convolution_param {
    weight_filler { type: 'xavier' }
    kernel_h: 5
    kernel_w: 5
    num_output: 64
    stride: 1
    pad: 0
    group: 2
  }
}

layer {
  name: "layer2"
  type: "ReLU"
  bottom: "layer1"
  top: "layer1"
}

layer {
  name: "layer3"
  type: "Pooling"
  bottom: "layer1"
  top: "layer3"
  pooling_param {
    pool: MAX
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    pad_h: 0
    pad_w: 0
  }
}

layer {
  name: "layer4"
  type: "Convolution"
  bottom: "layer3"
  top: "layer4"
  convolution_param {
    weight_filler { type: 'xavier' }
    kernel_h: 5
    kernel_w: 5
    num_output: 64
    stride: 1
    pad: 0
  }
}

layer {
  name: "layer5"
  type: "ReLU"
  bottom: "layer4"
  top: "layer4"
}

layer {
  name: "layer6"
  type: "Convolution"
  bottom: "layer4"
  top: "layer6"
  convolution_param {
    weight_filler { type: 'xavier' }
    kernel_h: 4
    kernel_w: 4
    num_output: 128
    stride: 1
    pad: 0
  }
}

layer {
  name: "layer7"
  type: "ReLU"
  bottom: "layer6"
  top: "layer6"
}

layer {
  name: "layer8"
  type: "Pooling"
  bottom: "layer6"
  top: "layer8"
  pooling_param {
    pool: MAX
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    pad_h: 0
    pad_w: 0
  }
}

layer {
  name: "layer9"
  type: "Convolution"
  bottom: "layer8"
  top: "layer9"
  convolution_param {
    weight_filler { type: 'xavier' }
    kernel_h: 13
    kernel_w: 13
    num_output: 1024
    stride: 1
    pad: 0
  }
}

layer
{
  name: "drop1"
  type: "Dropout"
  bottom: "layer9"
  top: "layer9"
  dropout_param {
    dropout_ratio: 0.5
  }
  include {
    phase: TRAIN
  }
}

layer {
  name: "layer10"
  type: "ReLU"
  bottom: "layer9"
  top: "layer10"
}

layer {
  name: "layer11"
  type: "InnerProduct"
  bottom: "layer10"
  top: "layer11"
  inner_product_param {
    weight_filler { type: 'xavier' }
    num_output: 8
  }
}

layer {
  name: "layer12"
  type: "SoftmaxWithLoss"
  bottom: "layer11"
  bottom: "label"
  top: "loss"
  include {
    phase: TRAIN
  }
}

layer {
  name: "layer12"
  type: "Softmax"
  bottom: "layer11"
  top: "layer12"
  include {
	phase: TEST
  }
}